Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན། བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: “By this root of virtue may I become a protector for the world’s blind who are without a guide, without anyone to lead them, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—a blessed buddha.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་དེ་ལ་བཀའ་སྩལ་པ། བྲམ་ཟེའི་ཁྱེའུ་ལེགས་སོ། །ལེགས་སོ། །
en: The Blessed One said to the brahmin, “Very good, brahmin, very good.

source: མ་འོངས་པའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད། འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཐུན་མཛད་ཅེས་བྱ་བར་འགྱུར་རོ། །
en: Brahmin, in the future you will be a protector for the world’s blind who are without a guide, without anyone to lead them, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—the blessed buddha known as Conciliator.”

source: པད་མ་གཉིས་ཞེས་བྱ་བ་དེ་ལ། པད་མ་གཉིས་ཞེས་བྱ་བ་དེ་ལ།
en: Padmottama: Two Stories

source: པད་མ་དང་པོ་ནི།
en: The First “Padmottama” Story

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་ལུགས་ཀྱིས་ན། ཉིན་གཅིག་བཞིན་དུ་དུས་གསུམ་དུ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འགྲོ་ཞིང་།
en: When the Blessed One was in Śrāvastī, it was King Prasenajit’s custom to go to see the Blessed One three times a day.

source: བཅོམ་ལྡན་འདས་ལ་བདུག་པ་དང་། ཕྱེ་མ་དང་། སྤོས་དང་མེ་ཏོག་རྣམས་ཀྱིས་མཆོད་པ་བྱས་ནསཆོས་ཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: He would worship him with flowers, burning sticks of incense, incense powders, and incense cones, then sit before him to listen to the Dharma.

source: དེའི་ཚེ་ཀུན་དགའ་ར་བའི་སྲུངས་མའི་གནས་དགའ་ལྡན་གྱི་པད་མའི་མཚོའི་ནང་ན། དུས་མ་ཡིན་པར་པད་མ་ཞིག་སྐྱེས་ནས།
en: At that time a lotus bloomed out of season on a pond at a groundskeeper’s residence.

source: དེའི་བློ་སྐྱེས་པ།
en: The groundskeeper thought,

source: རྒྱལ་པོ་གསལ་རྒྱལ་ཉིན་གཅིག་བཞིན་དུ་དུས་གསུམ་དུ་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་བདུག་པ་དང་། ཕྱེ་མ་དང་སྤོས་དང་མེ་ཏོག་རྣམས་ཀྱིས་བཀུར་སྟིར་བྱེད་ཀྱི་པད་མ་འདི་བདག་གིས་དེ་ལ་འབུལ་བར་བྱའོ་སྙམ་ནསདེ་ཁྱེར་ཏེ་མཉན་དུ་ཡོད་པར་སོང་ངོ་། །
en: “Three times a day King Prasenajit offers flowers, burning sticks of incense, incense powders, and incense cones to the ascetic Gautama, so I will give this lotus to him,” and he brought the lotus to Śrāvastī.

source: དེའི་ཚེ་སྲེད་མེད་ཀྱི་བུ་ལ་དད་པ་ཞིག་ཡ་མཚན་ཅན་ཐམས་ཅད་ལ་མཆོད་སྦྱིན་བྱེད་པ་ལ་ཞུགས་སོ། །དེ་ནས་དེས་མི་དེས་དུས་མ་ཡིན་པའི་པད་མ་དེ་ལྟ་བུ་ཁྱེར་ཏེ།
en: At that time there was a devotee of Nārāyaṇa performing a sacrifice for all the renunciants of heterodox views, and he saw the man carrying the out-of-season lotus.

source: འོང་བ་ཡང་མཐོང་ནས། དེས་དེ་ལ་སྨྲས་པ།
en: When he saw him approaching, he called out, “Sir!

source: ཀྱེ་མི་ཁྱོད་ཀྱི་པད་མ་འོ་ནི་བདག་ལ་བྱིན་ཅིག་དང་།
en: Please give your lotus to me!

source: འདི་བདག་གིས་ལེགས་ལྡན་སྲེད་མེད་ཀྱི་བུ་ལ་མཆོད་པར་བྱའོ། །
en: I shall use it to make offerings to the blessed deity Nārāyaṇa,

source: ཁྱོད་ལ་ཡང་བདག་གིས་ཀཱར་ཥཱ་པ་ཎ་ལྔ་བརྒྱ་སྦྱིན་ནོ་ཞེས་བྱས་སོ། །
en: and I shall also give five hundred gold coins to you.”

source: དེའི་ཚེ་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་། བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་ཆས་པ་ལས།
en: At that time the householder Anāthapiṇḍada was going to see the Blessed One with his five hundred servants.

source: ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་མི་དེ་ཚིག་དེ་སྐད་ཟེར་བ་ཐོས་སོ། །ཐོས་ནས་ཀྱང་དེས་བསམས་པ།
en: The householder Anāthapiṇḍada heard what the man said, and thought,

source: འདི་ནི་ཉེས་པར་བཤད་པའི་ཆོས་ཅན་ཡིན་ན།
en: “This man errs in his judgment.

source: ནོར་གྱི་བུངས་འདི་སྙེད་ཅིག་ཉོས་ཏེ་སྲེད་མེད་ཀྱི་བུ་ལ་འབུལ་བར་འདོད་ན། ཅིའི་ཕྱིར་ངས་ནོར་ཆེས་མང་དུ་བསྐྱེད་དེ་ཉོས་ལ། བཅོམ་ལྡན་འདས་ལ་དབུལ་བར་མི་བྱ་སྙམ་ནས།
en: If he wishes to pay such a large sum to offer this to Nārāyaṇa, why don’t I produce a still greater sum and buy it to offer to the Blessed One?”

source: དེས་ཀུན་དགའ་ར་བའི་སྲུངས་མ་ལ་སྨྲས་པ།
en: So he said to the groundskeeper,

source: ངས་ཁྱོད་ལ་ཀཱར་ཥཱ་པ་ཎ་སྟོང་སྦྱིན་གྱི། པད་མ་འོ་ནི་ང་ལ་བྱིན་ཅིག །
en: “I’ll give you a thousand gold coins to give the lotus to me.”

source: དེ་ནས་སྲེད་མེད་ཀྱི་བུ་ལ་དད་པ་དེས་ཐོས་ནས་ང་རྒྱལ་སྐྱེས་ཏེ།
en: When the devotee of Nārāyaṇa heard this, with a feeling of superiority he said,

source: དེས་ཀཱར་ཥཱ་པ་ཎ་ཉིས་སྟོང་སྦྱིན་པར་བྱས་སོ། །
en: “I shall give you two thousand gold coins!”

source: དེ་བཞིན་དུ་དེ་གཉིས་ཀྱིས་ཀཱར་ཥཱ་པ་ཎ་འབུམ་གྱི་བར་དུ་གོང་ནས་གོང་དུ་བསྐྱེད་དོ། །
en: Continuing in that way, the two increased their bids up to a hundred thousand gold coins.

source: དེ་ནས་ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེའི་བློ་སྐྱེས་པ།
en: Then the groundskeeper thought,

source: འདི་ལྟར་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ལྟ་བུས་མི་ཞིག་གི་ཕྱིར་འབུམ་གཏོང་བར་བྱེད་པ་དང་སྦྱར་ན། དགེ་སློང་གཽ་ཏ་མ་དེ་ནི་ཆེ་བ་ཞིག་ཡིན་གོར་མ་ཆག་ན།
en: “If the householder Anāthapiṇḍada would give a hundred thousand gold coins like this for his sake, the ascetic Gautama must be truly great.

source: ཅིའི་ཕྱིར་བདག་ཉིད་སོང་ལ། བཅོམ་ལྡན་འདས་དེ་ལ་མཆོད་པར་མི་བྱ་སྙམ་དུ་བསམས་ནས།
en: Why don’t I go and make an offering to the Blessed One myself?”

source: ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ལ་སྨྲས་པ།
en: So the gardener told the householder Anāthapiṇḍada,

source: ཁྱིམ་བདག་བདག་ལ་ནོར་མི་དགོས་ཀྱི།
en: “Householder, I have no need for wealth.

source: བདག་ཉིད་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་ལ་མཆོད་པར་བྱའོ་ཞེས་བྱས་ནས
en: I will go and offer it to the Blessed One myself.”

source: པད་མ་དེ་ཁྱེར་ཏེ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་སོང་ནས། ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེས། ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ།
en: As he was carrying the lotus to the garden of Prince Jeta, he caught sight of the Blessed Buddha from a distance. His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire,

source: བློ་གསལ་ཞིང་དྲི་མ་མེད་ལ། རྣམ་པར་དག་པ་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: He was immaculate, clear-minded, and pure of heart.

source: དགའ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ཕྱིར་སྟེང་དུ་བོར་ན།
en: In joy he approached the Blessed One, and upon his arrival he touched his head to the Blessed One’s feet and cast the lotus toward him in worship.

source: བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་པད་མ་དེ་ཤིང་རྟའི་འཕང་ལོ་ཙམ་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་གཤེགས་ན་ནི་འགྲོའོ། །
en: Then, by the power of the Blessed One, the lotus became like the wheel of a chariot above him, moving when the Blessed One moved,

source: གཞེས་ན་ནི་སྡོད་དོ། །
en: and remaining still when he sat still.

source: དེ་ནས་ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེས། ཆོ་འཕྲུལ་དེ་ལྟ་བུ་མཐོང་ནས། ལྷག་པར་ཡང་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པ།
en: When he witnessed this miracle, the groundskeeper was especially filled with joy toward the Blessed One, and he prayed for unexcelled, total, and complete enlightenment, saying,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: “By this root of virtue may I become a protector for the world’s blind who are without a guide, without anyone to lead them, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—a blessed buddha.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེ་ལ་བཀའ་སྩལ་པ། བཞིན་བཟངས་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One said to the groundskeeper, “Very good, my friend, very good.

source: མ་འོངས་པའི་དུས་ན་ཁྱོད་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་པད་མའི་བླ་མ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་གསུངས་སོ།། །།
en: In the future you will be a protector for the world’s blind who are without a guide, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—the blessed buddha known as Padmottama.”

source: པད་མ་གཉིས་པ་ནི།
en: The Second “Padmottama” Story

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་དེ་ཉིད་ན། ཀུན་དགའ་ར་བ་སྲུང་བ་ཞིག་འདུག་པ། དེའི་མཚོའི་ནང་ནས་དུས་མ་ཡིན་པར་པད་མ་ཞིག་སྐྱེས་ཏེ།
en: When the Blessed One was in Śrāvastī, there lived a certain groundskeeper who saw a lotus growing out of season in a lake.

source: པད་མ་འདི་བདག་གིས་རྒྱལ་པོ་གསལ་རྒྱལ་ལ་དབུལ་བར་བྱའོ། །
en: “Let me offer this to King Prasenajit,

source: འོན་ཏང་བདག་གི་ལོངས་སྤྱོད་ཆེན་པོ་དག་གི་འབྱུང་ཁུངས་སུ་འགྱུར་རོ་སྙམ་ནས།
en: that it might become a source of wealth for me,”

source: དེ་ཁྱེར་ཏེ་རྒྱལ་པོའི་ཕོ་བྲང་དུ་ཆས་ཏེ་སོང་ངོ་། །
en: so he bore it off to the royal palace.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་། ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི། ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: སུ་ལ་ནི་སངས་རྒྱས་བྱུང་བས་བརྒྱན་པའི་འཇིག་རྟེན་འབྲས་བུ་ཡོད་པར་བྱ་སྙམ་དུ་ཡེ་ཤེས་གཟིགས་པ་འཇུག་གོ། །
en: For whom shall I cause this world, adorned with a buddha’s presence, to be fruitful?”

source: འདུལ་བར་བྱ་བའི་སྲས་རྣམས་ལ། །སངས་རྒྱས་དུས་ལས་ཡོལ་བ་མེད། །
en: But when the time has come to tame Their offspring, buddhas never fail.

source: ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་སེམས་བསྐྱེད་པར་འགྱུར་རོ་
en: “This groundskeeper will pursue unexcelled, total, and complete enlightenment with single-minded resolve.”

source: སྙམ་དུ་དགོངས་ནས། སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ་ལྷུང་བཟེད་བསྣམས་ནས། མཉན་དུ་ཡོད་པར་བསོད་སྙོམས་ལ་གཤེགས་སོ། །
en: With this in mind, in the morning he donned his lower garment and Dharmaa robes, and, carrying his alms bowl, he went for alms in Śrāvastī.

source: དེ་ནས་ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེས། ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: The groundskeeper saw the Blessed Buddha from a distance,

source: དགའ་བར་གྱུར་ནས་བསམས་པ།
en: In his joy he thought,

source: བདག་གིས་རྒྱལ་པོ་གསལ་རྒྱལ་བཏང་ལ། བཅོམ་ལྡན་འདས་ལ་བདག་ཉིད་ཀྱིས་མཆོད་པ་བྱའོ་སྙམ་ནས།
en: “Forget about King Prasenajit, I’m going to offer worship to the Blessed One myself.”

source: དེས་པད་མ་དེ་བཅོམ་ལྡན་འདས་ཀྱི་སྟེང་གི་ནམ་མཁའ་ལ་བོར་བ་ལས། བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་པད་མ་དེ་ཤིང་རྟའི་འཕང་ལོ་ཙམ་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་གཤེགས་ན་ནི་འགྲོའོ། །
en: So he tossed the lotus into the sky above the Blessed One, and by the power of the Blessed One the lotus became like the wheel of a chariot above him, moving when the Blessed One moved,

source: དེ་ནས་ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེས་ཆོ་འཕྲུལ་དེ་ལྟ་བུ་མཐོང་ནས། ལྷག་པར་ཡང་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་སྟེ།
en: Upon witnessing such a miracle the groundskeeper was especially filled with joy toward the Blessed One, and he prayed for unexcelled, total, and complete enlightenment, saying,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: “By this root of virtue may I become a protector for the world’s blind who are without a guide, without anyone to lead them, a tathāgata, an arhat, a totally and completely awakened buddha one possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—a blessed buddha.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀུན་དགའ་ར་བའི་སྲུངས་མ་དེ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One said to the groundskeeper,

source: བཞིན་བཟངས་ལེགས་སོ་ལེགས་སོ། །
en: “Very good, my friend, very good.

source: མ་འོངས་པའི་དུས་ན་ཁྱོད་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་བླ་མ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་གསུངས་སོ།། །།
en: In the future you will be a protector for the world’s blind who are without a guide, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—the blessed buddha known as Uttama.”

source: ལྟ་བ་ཞེས་བྱ་བ་ནི།
en: The Story of Sudarśana

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་མཉམ་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་ཏེ
en: When the Blessed One was in Śrāvastī, there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཁྱིམ་བདག་དེ་ཡང་བྱམས་པའི་རང་བཞིན་ཅན། སྙིང་རྗེ་དང་ལྡན་པ།
en: The householder was of a loving nature, quite compassionate, and equitable in charity.

source: སེམས་ཅན་ཐམས་ཅད་ལ་མཉེས་གཤིན་པ། སྦྱིན་པ་ལ་སྲེད་པ། ཡ་མཚན་ཅན་ཐམས་ཅད་དང་ལྟ་བ་མཚུངས་པ། སྦྱིན་པ་ལ་བློ་སྙོམས་པ་ཞིག་སྟེ།
en: He cared for beings, wanted deeply to perform acts of charity, and regarded persons of any and every type of view equally.

source: དེས་དུས་དུས་སུ་མཆོད་སྦྱིན་ཆེན་པོ་བྱེད་ལ། བསྟན་བཅོས་སྤྱོད་པ་རྣམས་ཀྱི་གཞུང་སྤྱོད་པར་བྱེད་དོ། །
en: From time to time he performed a great sacrifice and engaged in textual studies of the treatises.

source: དེས་བལྟས་ན་ཐམས་ཅད་ཀྱང་བདག་ལ་ནི་སྟོད། གཞན་ལ་ནི་སྨོད་པར་བྱེད་པས། དེ་དག་གིས་ཁྱིམ་བདག་དེའི་སེམས་མ་མགུའོ། །
en: When he looked out, he saw that he was getting all of the praise while others were being disparaged, and they were unhappy with him.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེས། བཅོམ་ལྡན་འདས་ཀྱི་བསྔགས་པ་ཐོས་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: One day the householder heard the Blessed One being praised, and he thought,

source: དེས་ཆོས་ཐམས་ཅད་རྟོགས་པ་ལས་ན། བཅོམ་ལྡན་འདས་དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཡིན་པར་ངེས་སོ་སྙམ་ནས།
en: “Since the Blessed One has realized all dharmas, it’s certain he’s omniscient.”

source: བསྔགས་པ་ཐོས་མ་ཐག་ཏུ་སེམས་སྐྱེས་པ།
en: And when he heard him being praised, he thought,

source: ཀྱེ་མ་བཅོམ་ལྡན་འདས་དེ་བདག་གི་མཆོད་སྦྱིན་གྱི་གནས་འདིར་གཤེགས་ཀྱང་ཅི་མ་རུང་སྙམ་མོ། །
en: “How good it would be for the Blessed One to come to the site of my sacrifice!”

source: བདག་གིས་ཁྱིམ་བདག་དེའི་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་པར་བྱ་དགོས་ལ།
en: “I will generate the root of virtue in this householder.

source: འདི་ལ་བརྟེན་ནས་འདུལ་བར་བྱ་བ་ཕལ་པོ་ཆེ་དྲང་དུ་ཡོད་དོ་སྙམ་ནས
en: He will be instrumental in guiding a great many disciples.”

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ཏེ། ཁྱིམ་བདག་དེའི་མཆོད་སྦྱིན་གྱི་གནས་སུ་ཞུགས་པར་གྱུར་ཏོ། །
en: With that thought he disappeared from the garden of Prince Jeta and approached the householder’s site of sacrifice.

source: དེ་ནས་ཁྱིམ་བདག་དེས་ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: The householder saw the Blessed Buddha from a distance,

source: དགའ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Full of such joy, he approached the Blessed One, touched his head to the Blessed One’s feet, and beseeched him,

source: ཀྱེ་མ་བཅོམ་ལྡན་འདས་བདག་གི་མཆོད་སྦྱིན་གྱི་གནས་སུ་གཤེགས་ཏེ།
en: “Please come to the site of my sacrifice.

source: ལོངས་སྤྱོད་པར་མཛད་དུ་གསོལ།
en: I ask that you please partake,”

source: དེ་ནས་ཁྱིམ་བདག་དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་བདེ་བར་བཞུགས་པར་རིག་ནས།
en: Once the householder knew that the Buddha and the rest of the saṅgha of monks were comfortably seated,

source: རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ། ཅི་བཞེད་པ་བསྟབས་ནས་
en: by his own hand he contented them with many good, wholesome foods, proffering all that they wished,

source: ཆོས་ཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: and sat before them to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྤྲོ་བ་བསྐྱེད་ནས།
en: The Blessed One spurred him on to achieve unexcelled, total, and complete enlightenment,

source: ཁྱིམ་བདག་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་འདོད་པ་སྐྱེས་ནས།
en: and so the householder felt a strong desire for unexcelled, total, and complete enlightenment.

source: དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ཟླ་བ་གསུམ་སྤྱན་དྲངས་ཏེ། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས།
en: He extended an invitation to the Buddha and the rest of the saṅgha of monks for three months, and provided everything they needed.

source: ཐ་མའི་ཉིན་པར་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ་གསོལ་ནས།
en: On the last day he offered the Buddha and the rest of the saṅgha of monks food of a hundred flavors,

source: བཅོམ་ལྡན་འདས་ལ་ན་བཟའ་འབུམ་རི་བ་ཕུལ་ལོ། །
en: and to the Blessed One he offered a very costly robe.

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི། ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: “By this root of virtue may I become a protector for the world’s blind who are without a guide, without anyone to lead them, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—a blessed buddha.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་དེ་ལ་བཀའ་སྩལ་པ། ཁྱིམ་བདག་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One said to the householder, “Very good, householder, very good.

source: མ་འོངས་པའི་དུས་ན་ཁྱོད་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ། སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལེགས་མཐོང་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་གསུངས་སོ།། །།
en: Householder, in the future you will be a protector for the world’s blind who are without a guide, a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—the blessed buddha known as Sudarśana .”

source: རིན་པོ་ཆེ་ཞེས་བྱ་བ་ནི།
en: The Story of Ratnaśikhin

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ནས་དེད་དཔོན་ཞིག་གིས་ཟོང་ཁྱེར་ཏེ། རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་ཆས་སོ། །
en: When the Blessed One was in Śrāvastī, there lived a certain caravan leader who loaded up his wares to set out on the great ocean.

source: དེད་དཔོན་དེ་ཡང་མོ་ལྟས་གཙོ་བོར་འཛིན་པ་ཞིག་སྟེ། དེ་ཟོང་རྣམས་རྔ་མོ་དང་བོང་བུ་ལ་སོགས་པ་ལ་བཀལ་ནས། མཉན་དུ་ཡོད་པའི་ཕྱི་སྒོ་ཆེན་མོ་ལས་བྱུང་སྟེ། ལམ་པོ་ཆེར་ཞུགས་ནས་དེས་སེམས་འདི་ལྟ་བུ་བསྐྱེད་དེ།
en: Having loaded his wares onto camels, donkeys, and other animals, the trader exited the gates of Śrāvastī out onto the main road. Being a person who put a lot of stock in prognostications, he thought,

source: གལ་ཏེ་བདག་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ནས། ཉེ་ཞོ་མེད་པར་བདེ་བར་འོངས་ཏེ། རྒྱ་མཚོའི་གྲུ་བོ་ཆེའི་དོན་གྲུབ་ནས། ཕྱིར་འཁོར་བར་གྱུར་ན་སྒོ་འདིར་བདག་གི་སྒོའི་དུས་སྟོན་བྱའོ། །
en: “If I return happily from the great ocean without mishap, then upon my return after I have successfully completed my voyage, I shall hold a great festival at this gate.

source: ལམ་པོ་ཆེ་འདིར་ཡང་ལམ་གྱི་དུས་སྟོན་བྱའོ་ཞེས་བྱས་ནས་
en: All along this highway too I shall hold a great festival.”

source: རྒྱ་མཚོ་ཆེན་པོར་སོང་ངོ་། །
en: With that he set out on the great ocean.

source: དེ་ནས་དེ་རིན་པོ་ཆེའི་གླིང་བགྲོད་པར་བསྒྲུབས་ཏེ། རྒྱ་མཚོ་ཆེན་པོའི་ནང་ནས་འགྲམ་དུ་བྱུང་ནས། དེས་བསམས་པ།
en: After he had completed his journey to Ratnadvīpa, he came ashore from the great ocean and thought,

source: བདག་གྲུ་བོ་ཆེས་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་ཞུགས་ཏེ། དེས་ན་བདག་གིས་ནོར་ཆེན་པོ་བསྒྲུབས་ཀྱིས།
en: “I set out on the great ocean aboard a great vessel and attained great wealth,

source: བདག་གིས་རྒྱ་མཚོའི་འགྲམ་འདི་ཉིད་དུ་རྒྱ་མཚོའི་ལྷ་རྣམས་དང་། གྲུ་བོ་ཆེ་ལ་གནས་པའི་ལྷ་རྣམས་ལ་བཀུར་སྟི་བྱའོ་སྙམ་ནས
en: so I will perform an exalted veneration of the gods of these shores, and of the deities who dwell upon the ships.”

source: དེས་རྒྱ་མཚོའི་འགྲམ་དེ་ཉིད་དུ་ལྷ་རྣམས་ལ་བཀུར་སྟི་ཆེན་པོ་བྱས་ཏེ།
en: He performed a large sacrifice to the gods of the shore,

source: མཉན་དུ་ཡོད་པར་ཆས་སོ། །
en: and then traveled toward Śrāvastī.

source: དེ་ནས་དེ་མཐར་གྱིས་རྒྱུ་ཞིང་སོང་སོང་བ་ལས། མཉན་དུ་ཡོད་པར་ཕྱིན་ནས། མཉན་དུ་ཡོད་པར་ཟོང་རྣམས་བཞག་སྟེ།
en: He made his way through the countryside, and unloaded his wares when he arrived in Śrāvastī.

source: དེས་གྲོང་ཁྱེར་གྱི་ཕྱི་སྒོ་ཆེན་པོ་དང་། ལམ་པོ་ཆེ་དེའི་ལྷ་རྣམས་ལ་མཆོད་པ་ཆེན་པོ་བྱས་ནས།
en: After performing a great sacrifice to the deities of the city gates and of the main road,

source: སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་པ་ལ་ཞུགས་ཏེ།
en: he began to give gifts and make merit.

source: དེས་རིན་པོ་ཆེའི་ཕུང་པོ་ཆེན་པོ་སྤུངས་ནས། དགེ་སྦྱོང་དང་བྲམ་ཟེ་དང་། སྤྱོད་པ་པ་དང་ཀུན་ཏུ་རྒྱུ་དང་། སྡུག་ཅིང་ཕོངས་པ་དང་། བཀྲེས་པ་རྣམས་ལ་སྦྱིན་པ་བྱེད་པ་ལ་ཞུགས་སོ། །
en: He heaped up jewels and gave them as gifts to the ascetics, brahmins, carakas, parivrājakas, the bereft, and the hungry.
